<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">@import url('https://themes.googleusercontent.com/fonts/css?kit=dB3GuSCq0f_LRNaO3opFPA');ol{margin:0;padding:0}table td,table th{padding:0}.c12{-webkit-text-decoration-skip:none;color:#000000;text-decoration:underline;vertical-align:baseline;
text-decoration-skip-ink:none;font-size:18pt;font-style:normal}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Open Sans";font-style:normal}.c13{-webkit-text-decoration-skip:none;color:#000000;text-decoration:underline;vertical-align:baseline;text-decoration-skip-ink:none;font-size:11pt;font-style:normal}.c1{padding-top:0pt;text-indent:35pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c9{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:10pt;font-family:"Open Sans";font-style:normal}.c3{padding-top:0pt;text-indent:36pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c11{background-color:#ffff00;color:#00ff00;text-decoration:none;vertical-align:baseline;font-size:11pt;font-style:normal}.c7{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c6{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:center}.c5{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c2{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c10{font-weight:400;font-family:"Open Sans"}.c8{text-indent:36pt}.c4{height:11pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c2"><p class="c7"><span class="c10">&nbsp;</span><span class="c9">Burlats Auguste, Calvinhac Martin, Fillion Robin, Lacroix-Blum Capucine, Tixeront Quentin</span></p><p class="c4 c7"><span class="c9"></span></p><p class="c6"><span class="c10 c12">Conduite de projet</span></p><p class="c7"><span class="c0">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span></p><p class="c5"><span class="c0">Au d&eacute;but du projet, nous avons repris le sch&eacute;ma d&rsquo;impl&eacute;mentation dont nous nous sommes servis au pr&eacute;alable lors de l&rsquo;esquisse du projet.</span></p><p class="c5 c4"><span class="c0"></span></p><p class="c1"><span class="c0">Nous avons commenc&eacute; par reprendre notre sch&eacute;ma pour discuter durant une heure de notre fa&ccedil;on de travailler. Ainsi, nous nous sommes r&eacute;partis en 3 &eacute;quipes. Une &eacute;quipe s&rsquo;occupait de la partie client, une autre de la partie serveur, et la derni&egrave;re s&rsquo;est attel&eacute;e &agrave; la cr&eacute;ation de la base de donn&eacute;es. </span></p><p class="c5"><span class="c0">Nous avons d&eacute;termin&eacute; en avance les grandes lignes que chacune des &eacute;quipes suivait pour faciliter la mise en commun.</span></p><p class="c1 c4"><span class="c0"></span></p><p class="c1"><span class="c0">Notre objectif &eacute;tait qu&rsquo;au fur et &agrave; mesure de notre projet, nous puissions effectuer des tests pour nous assurer de notre avanc&eacute;e. Les tests qui n&eacute;cessitent la mise en commun des diff&eacute;rents travaux du projet &eacute;taient effectu&eacute;s &agrave; la fin des s&eacute;ances de projet. Ce faisant, chacun pouvait avoir une vue d&rsquo;ensemble sur l&rsquo;avanc&eacute;e du projet, et apporter un feedback sur les parties auxquelles il n&rsquo;&eacute;tait pas assign&eacute;.</span></p><p class="c1 c4"><span class="c0"></span></p><p class="c1"><span class="c0">La premi&egrave;re s&eacute;ance a connu la cr&eacute;ation du GitHub du projet, l&rsquo;impl&eacute;mentation du squelette de la base de donn&eacute;es ainsi qu&rsquo;un sch&eacute;ma du site internet, ligne de vue de notre &eacute;quipe.</span></p><p class="c1 c4"><span class="c0"></span></p><p class="c1"><span class="c0">A la seconde s&eacute;ance, nous avons revu &nbsp;notre mod&egrave;le du site. Nous avons d&eacute;termin&eacute; que l&rsquo;utilisation de Angular n&rsquo;&eacute;tait pas n&eacute;cessaire et alourdissait notre travail. En effet, utilisant Flask pour la partie Back-End, la pr&eacute;sence d&rsquo;Angular ajoutait un second serveur tournant en parall&egrave;le, et la communication entre les deux entit&eacute;s entra&icirc;nait redondance. Il fallait garder le framework Flask car, pour des raisons de s&eacute;curit&eacute;, nous ne pouvions laisser Angular communiquer directement avec la base de donn&eacute;es.</span></p><p class="c1 c4"><span class="c0"></span></p><p class="c1"><span class="c0">Nous d&eacute;cid&acirc;mes donc d&rsquo;enlever Angular et de conserver la partie Flask, que nous ma&icirc;trisons mieux, ainsi que de g&eacute;rer le Front-End qu&rsquo;&agrave; l&rsquo;aide de templates HTML et de CSS. Un des membres de l&rsquo;&eacute;quipe serveur s&rsquo;est donc consacr&eacute; &agrave; la partie graphique &agrave; partir de la troisi&egrave;me s&eacute;ance.</span></p><p class="c5"><span class="c0">Pour continuer de discuter de la conduite du projet il convient de s&rsquo;int&eacute;resser plus en d&eacute;tail au travail de chacune des &eacute;quipes.</span></p><p class="c5 c4"><span class="c0"></span></p><p class="c5"><span class="c13 c10">Base de donn&eacute;es:</span></p><p class="c3 c4"><span class="c0"></span></p><p class="c3"><span class="c0">La premi&egrave;re chose &agrave; r&eacute;aliser &eacute;tait de d&eacute;terminer les diff&eacute;rentes tables qui allaient constituer notre base de donn&eacute;es. Pour ce faire nous avons d&rsquo;abord r&eacute;fl&eacute;chi &agrave; un mode de fonctionnement moins ambitieux. &nbsp;Nous avions annonc&eacute; vouloir obtenir les donn&eacute;es sur les prix de vol Air France en temps quasi r&eacute;el. En pratique il aurait fallu contacter l&#39;entreprise ou apprendre rapidement &agrave; ma&icirc;triser une nouvelle interface de programmation. Le temps et le bagage technique dont nous disposions ne permettant pas la mise en place d&rsquo;un tel fonctionnement, nous avons pens&eacute; &agrave; un syst&egrave;me de table pour les offres, qui pourrait &ecirc;tre mise &agrave; jour et compl&eacute;t&eacute;e par les compagnies de transport directement via le site WEB. Nous avons d&eacute;velopp&eacute; un programme python pour v&eacute;rifier la cr&eacute;dibilit&eacute; d&rsquo;une offre soumise c&ocirc;t&eacute; serveur. Cot&eacute; base de donn&eacute;es, nos tables sont alors devenues: OFFRES (dont les attributs d&eacute;finissent une offre de transport: d&eacute;part, arriv&eacute;e, date, vendeur, moyen de transport, lien) destination (pour une ville donn&eacute;e, on a un environnement pr&eacute;cis) , meteo (associe une m&eacute;t&eacute;o &agrave; une ville et une p&eacute;riode), client et vendeur. Nous l&rsquo;avons rendue FNBC. La base n&rsquo;a cess&eacute; d&#39;&eacute;voluer pour r&eacute;pondre aux besoins du projet: la granularit&eacute; est pass&eacute;e de pays &agrave; ville pour plus de pr&eacute;cision en terme de m&eacute;t&eacute;o, environnement etc&hellip; Notre choix d&rsquo;ajouter un espace client nous a &eacute;galement amen&eacute;s &agrave; cr&eacute;er une nouvelle table historique, pour que les utilisateurs aient un acc&egrave;s &nbsp;&agrave; leurs anciennes recherches. Nous avons manuellement rempli la base de donn&eacute;es pour effectuer les premiers tests: Nous utilisions pour cela SQLite Studio et mettions r&eacute;guli&egrave;rement &agrave; jour la base de donn&eacute;es sur notre Github.</span></p><p class="c4 c5"><span class="c10 c11"></span></p><p class="c5 c4"><span class="c0"></span></p><p class="c5"><span class="c10 c13">Serveur</span></p><p class="c5"><span class="c0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span></p><p class="c3"><span class="c0">Le serveur a &eacute;t&eacute; cr&eacute;&eacute; pas &agrave; pas. Nous avons commenc&eacute; par la page d&rsquo;accueil du site, puis avons ajout&eacute; les routes principales donnant aux recherches simples puis complexes. Nous avons ensuite ajout&eacute; la possibilit&eacute; &agrave; nos vendeurs de se connecter pour proposer des nouvelles offres, puis la cr&eacute;ation de l&rsquo;admin. Par ailleurs, nous avons d&eacute;velopp&eacute; les pages register pour ajouter des nouveaux vendeurs, et par la suite des nouveaux clients. Enfin nous nous sommes focalis&eacute;s sur la cr&eacute;ation d&rsquo;une page client, lui permettant d&rsquo;enregistrer des offres. </span></p><p class="c5 c4"><span class="c0"></span></p><p class="c5"><span class="c13 c10">Client: </span></p><p class="c7"><span class="c0">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span></p><p class="c7 c8"><span class="c0">N&rsquo;ayant plus la possibilit&eacute; d&rsquo;utiliser Angular pour le Front-End, nous avons d&eacute;finis nous m&ecirc;mes les templates de nos pages avec HTML et CSS. </span></p><p class="c7 c4"><span class="c0"></span></p><p class="c7 c8"><span class="c0">En premier lieu, nous nous sommes concentr&eacute;s sur l&rsquo;affichage HTML des diff&eacute;rents &eacute;l&eacute;ments de chaque page, puis l&rsquo;affichage graphique au moyen de CSS.</span></p><p class="c7 c4 c8"><span class="c0"></span></p><p class="c7 c8"><span class="c0">Nous avons commenc&eacute; par la page d&rsquo;accueil et la page de recherche avanc&eacute;e et des des requ&ecirc;tes HTTP qu&rsquo;elles &eacute;mettent. Puis nous sommes pass&eacute;s aux pages de connection, d&rsquo;inscription et de soumission d&rsquo;offre. Enfin les pages affichant des r&eacute;sultats les ont rejointes, &agrave; savoir la page de r&eacute;sultat, la page de l&rsquo;espace client et la page de l&rsquo;administrateur.</span></p><p class="c7"><span class="c0">&nbsp;Apr&egrave;s un premier design rat&eacute;, nous sommes parvenus &agrave; un rendu simple qui nous plaisait &agrave; tous.</span></p></body></html>
